tap "homebrew/services"
tap "instantclienttap/instantclient"
tap "ngrok/ngrok"
tap "sanemat/font"
tap "stripe/stripe-cli"
tap "supabase/tap"
brew "openjdk"
brew "allure"
brew "jpeg-xl"
brew "aom"
brew "awscli"
brew "freetds"
brew "libavif"
brew "gd"
brew "php"
brew "composer"
brew "docker"
brew "exa"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "python@3.11"
brew "fontforge"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "hstr"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "kompose"
brew "minikube"
brew "nginx"
brew "node"
brew "openvino"
brew "perl"
brew "php-cs-fixer"
brew "php@8.1"
brew "phpstan"
brew "phpunit"
brew "pipx"
brew "pkgconf"
brew "plantuml"
brew "pre-commit", link: false
brew "pyenv"
brew "python@3.10"
brew "redis", restart_service: :changed
brew "starship"
brew "ta-lib"
brew "trash"
brew "tree"
brew "vim"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "sanemat/font/ricty"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "keepingyouawake"
cask "next"
cask "ngrok"
cask "play"
cask "popsql"
cask "temurin"
vscode "3ash.nord-flat"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "jebbs.plantuml"
vscode "kage1020.icon-collection"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tht13.html-preview-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zhang-renyang.vscode-react"
vscode "zobo.php-intellisense"
