3ash.nord-flat
anthropic.claude-code
anysphere.cursorpyright
anysphere.pyright
bierner.markdown-mermaid
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
github.vscode-github-actions
golang.go
hediet.vscode-drawio
jebbs.plantuml
kage1020.icon-collection
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-kubernetes-tools.vscode-kubernetes-tools
ms-playwright.playwright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
pkief.material-icon-theme
postman.postman-for-vscode
prisma.prisma
rangav.vscode-thunder-client
redhat.java
redhat.vscode-yaml
rifi2k.format-html-in-php
ritwickdey.liveserver
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
tht13.html-preview-vscode
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscodevim.vim
withfig.fig
xdebug.php-debug
xdebug.php-pack
yzhang.markdown-all-in-one
zhang-renyang.vscode-react
zobo.php-intellisense
